app/controllers/pages_controller.rb

INSERT INTO `pages` (`created_at`, `title`, `updated_at`, `content`) VALUES('2009-12-18 17:41:40', 'First Page', '2009-12-18 17:41:40', '<p>\r\n	<img alt=\"\" src=\"/assets/pictures/8/content_Children-honey-Wallpapers-731.jpg?1261158084\" style=\"width: 575px; height: 431px;\" /></p>\r\n')
---
  def create
    @page = Page.new(params[:page])
    if @page.save

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `content` = '<p>\r\n	<strong>123</strong></p>\r\n<p>\r\n	&nbsp;</p>\r\n<p>\r\n	&nbsp;</p>\r\n<p>\r\n	<img alt=\"\" src=\"/assets/pictures/8/content_Children-honey-Wallpapers-731.jpg?1261158084\" style=\"width: 575px; height: 431px;\" /></p>\r\n', `updated_at` = '2009-12-18 17:42:33' WHERE `id` = 1
---
  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(params[:page])